simmsb/tyrfing/vendor/avr-device/svd/attiny2313.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCKBIT</name>
      <description>Lockbits</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOCKBIT</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LB</name>
              <description>Memory Lock</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROG_VER_DISABLED</name>
                  <description>Further programming and verification disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_DISABLED</name>
                  <description>Further programming disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No memory lock features enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTA</name>
      <description>I/O Port</description>
      <baseAddress>0x00000039</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDRA</name>
          <description>Port A Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PINA</name>
          <description>Port A Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PORTA</name>
          <description>Port A Data Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTB</name>
      <description>I/O Port</description>
      <baseAddress>0x00000036</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDRB</name>
          <description>Port B Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PINB</name>
          <description>Port B Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PORTB</name>
          <description>Port B Data Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTD</name>
      <description>I/O Port</description>
      <baseAddress>0x00000030</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDRD</name>
          <description>Data Direction Register, Port D</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PIND</name>
          <description>Input Pins, Port D</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PORTD</name>
          <description>Data Register, Port D</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
